### Terragrunt Plan :memo:

```text
time=2024-07-11T16:21:04Z level=info msg=The stack at terraform will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/homelab/homelab/terraform/aliyun


Acquiring state lock. This may take a few moments...
module.nixos_hgh2.data.external.build: Reading...
module.nixos_hgh1.data.external.build: Reading...
module.nixos_hgh1.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh2.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh2.data.external.keyscan: Reading...
module.nixos_hgh2.data.external.build: Read complete after 12s [id=-]
module.nixos_hgh1.data.external.build: Read complete after 12s [id=-]
module.nixos_hgh1.data.external.keyscan: Reading...
module.nixos_hgh2.data.external.keyscan: Read complete after 3s [id=-]
module.nixos_hgh1.data.external.keyscan: Read complete after 3s [id=-]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # local_file.known_hosts will be created
  + resource "local_file" "known_hosts" {
      + content              = <<-EOT
            hz0.szp15.com ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOK8v/RP6Lnwn79IDQXFuSWnJTigBDSED+2MaHorWUj0
            hz0.szp15.com ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDgh7ENo69W+Zcd+N9O5tJKDrhmp7T+149b7nOSUXRi8pr2N3V8LGDZGAXcWFKIDhcH46+x5IWM/PiCOlOitcBpyWRhZULBUgEkVRUK2aW6oTYQPIMZjfJykHdR8g/VJ7+DCg/R3M5oIw2+SMuyC8SN1V/FODLwSedIAbV8eNYUIzkKkAWHi5PoPL0fJwe8Qv/HTxPsq1xJ0Mo/NCEq5RosE05vaM4UUyqQInFqWsrZuCrGn0bKOLhonk7oU1lAVYFTRWDNy44yp02lYdTPC6GzKA9UWxQWokla1uAOyMf+cge2YtBUkr1uCMdrysMR40Q4EB1b6Y5iUgq1TX2YGaToqNLMbp4No+7zO+p14Ut3dwJnPsXoPVRKpBDOQYxRCUDedDeN7BRlNVJtQRFp8B3o9S/vRxb+wli77BTCsBq3M+owQGEUq6ajcYbJt3yX6/6TuCZwVM01SaXZxrMYOYvlj+/kVs605KkBVPlHYP9syNjKQCGt7X8VPkM8dm4rlmtoce5/98qLT5IBNWkCBj+OQse2i7d1Q1xd8FqOG976dwY3eD/bRQRXxV3gh40jDucVF95zt2NTc7luwscEDwR+WW+ppHvg0BaB/T7D2M58sTYYmn4cfSX3pAMNHqKA5sN5U3fQiySDIRsoTopO97iwN49TOVLomHMvhgQtd9Y/EQ==
            172.16.0.76 ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAn+mBSr5Pqd4nevi6Y0ecCtacgqe2QKaFARMH+ctntZ
            172.16.0.76 ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDGF9AfGHG0UsqlXtrRCz+b7zWa3uwuz9u5MMZVk9R3M2i1wqB+uLUn45h8jspOnlO01vyBnjb4yrXsk14ktbBNQJHmPEguaiER3fpMwTA6OC+XIU7SqHoxHroSvUd3UyAzdtAeC3HVYpCcApFWoO5vhHJC+CGvLJhnYMGrV/D+YP+jAUITCe8bNtCYRe/CPJv2uIQyxJO5JLjhzeS9YTLcR7in0wW3PIy6C5ZgcNwnfYBLH+/KzWsfGEpZ7dNG2NWCH4J54mt3+5Euw1xIWDu5OOFV3PkK2S1RwqgAIvrSCfXVAtgdLRNIrlg1OuO/q0DAzmRjIE/KJpB7LgcP6aXgXfHrw0RN8PA81WGhKSnN6dW/Ma7UCUMn8etVWkEaz+MrNlmKmNR9p6kI0UApnvnnQYnnWAi2sLuA5XbVBxCbbbPIsPd+qxVzqegrOb0ItvL574D7NULID1oLxj57VEfYziuf2NRE2G+PXHRosT6Gt8Q1BcqiMAZneICQQpGyWWVpmbnnxavilqHa/FJZPYRh8DK+RjFYcKKthvyxk9kApD/e2MAanlfVZ5vDpCeyZvdsH0hb9IHSKo2SmyUqCXAlsbR6uAqRFrxmmdnUo8ZvyNNAZfqR48tda62EkynIJ9uJb4FRu+EJ15SF3bhZUpcnOxecIs8oEsIArXxZ/1ngyQ==
            172.16.0.78 ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICsB6i3THptH4mjE+dculUMv67/gBkOpdnj+MIPSMpmR
            172.16.0.78 ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQClVoPqgJ6bNKizWPLIk93fxA5A0SJuABEkNx0BYOjX7UuGhNFvH+nlnxo3JOqbmStz+IA8Q0ROZ/Jp6s+inNA0+kK8+9btrgN4cKo37NtAaeijNA6WdAbV9RFueYaiC3C8iG8N/ShfI7OKeYjZiLVFdxprLfgsmlJrA5f+HzTByCnKHAyc9yYeFqaUuVHB8quKvEWa6gaJVI0HJt0O2xeIQMWMhO4q/68YbiqWKPV16i+r8Hd+haSvU+cmOrJz1x6qUgymC6P1ppL1pNPyIQh8sqYJ+0Y/asILuRoi56r9YIogEVG/qlEK/vGdR9zuRCQixXYzUIRtuKLMSqFRdM3M8Jy5/5nyMle9JNFsVZa0HVVz5RgKBBhZR1gdUsN8zjV82XZ1U97aCtj+5YRrvYNwJezNI647n/Gk2GTZW8DO12HL8mkngJSIqX7QnCZgnQ0V7AoA0csbZjKie1+dBNqUM+XwuCJaor2giDHX8UjUfzb92QSRDQ1ybxfWJ9nF02TvFccj1JfMNvI+xkGIEbXGuLTe0KGBse3+zT4oRbYGM3I4AHUJpiCPVPjQie02O7qE8YVhLaxhZj2A6jkLHBOLTPqum+GVlXaxO+bZKD/8ZUQpxhqbG/QQmF4/mLnp9lfGtFFGqbuW+1RGcT9RhlgcBs38kVRhqIhKpqJP0TyltQ==
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../generated/known_hosts"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

**Status**: out of sync :warning: